app/controllers/items_controller.rb

  def index
    @item = Item.new
    @items = Item.where(menus_id: params[:menu_id])
    @thing = Menu.find(params[:menu_id])
---
SELECT "items".* FROM "items" WHERE "items"."menus_id" = 1
SELECT "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    p params
    @item = Item.new(params[:item])
    @item.menus_id = params[:menu_id]
    if @item.save
---
INSERT INTO "items" ("menus_id", "name", "price") VALUES ($1, $2, $3) RETURNING "id"  [["menus_id", nil], ["name", "toast"], ["price", 3]]