app/controllers/menus_controller.rb

  def index
    @menu = Menu.new
    @menus = Menu.all
---
SELECT "menus".* FROM "menus"

  def create
    @menu = Menu.new(params[:menu])
    if @menu.save
---
INSERT INTO "menus" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Wed, 20 Nov 2013 22:00:55 UTC +00:00], ["title", "ryan"], ["updated_at", Wed, 20 Nov 2013 22:00:55 UTC +00:00]]